zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz24/pic32cx1012bz24032-pinctrl.h
/* pa7_tc3wo1g2_in */
#define PA7_TC3WO1G2_IN  MCHP_PINMUX(a, 7, 0xe0, 9, periph)
/* pa7_tc3wo1_out */
#define PA7_TC3WO1_OUT   MCHP_PINMUX(a, 7, 0x24c, 22, periph)
/* pa7_tcc0wo0_out */
#define PA7_TCC0WO0_OUT  MCHP_PINMUX(a, 7, 0x248, 11, periph)
/* pa7_tcc0wo1_out */
#define PA7_TCC0WO1_OUT  MCHP_PINMUX(a, 7, 0x24c, 11, periph)
/* pa7_tcc0wo2_out */
#define PA7_TCC0WO2_OUT  MCHP_PINMUX(a, 7, 0x248, 13, periph)
/* pa7_tcc0wo3_out */
#define PA7_TCC0WO3_OUT  MCHP_PINMUX(a, 7, 0x24c, 13, periph)
/* pa7_tcc0wo4_out */
#define PA7_TCC0WO4_OUT  MCHP_PINMUX(a, 7, 0x248, 12, periph)
/* pa7_tcc0wo5_out */
#define PA7_TCC0WO5_OUT  MCHP_PINMUX(a, 7, 0x24c, 12, periph)
/* pa7_tcc1wo0_out */
#define PA7_TCC1WO0_OUT  MCHP_PINMUX(a, 7, 0x248, 14, periph)
/* pa7_tcc1wo1_out */
#define PA7_TCC1WO1_OUT  MCHP_PINMUX(a, 7, 0x24c, 14, periph)
/* pa7_tcc1wo2_out */
#define PA7_TCC1WO2_OUT  MCHP_PINMUX(a, 7, 0x248, 16, periph)
/* pa7_tcc1wo3_out */
#define PA7_TCC1WO3_OUT  MCHP_PINMUX(a, 7, 0x24c, 16, periph)
/* pa7_tcc1wo4_out */
#define PA7_TCC1WO4_OUT  MCHP_PINMUX(a, 7, 0x248, 15, periph)
/* pa7_tcc1wo5_out */
#define PA7_TCC1WO5_OUT  MCHP_PINMUX(a, 7, 0x24c, 15, periph)
/* pa7_tcc2wo0_out */
#define PA7_TCC2WO0_OUT  MCHP_PINMUX(a, 7, 0x248, 17, periph)
/* pa7_tcc2wo1_out */
#define PA7_TCC2WO1_OUT  MCHP_PINMUX(a, 7, 0x24c, 17, periph)
/* pa8_cclin1_in */
#define PA8_CCLIN1_IN    MCHP_PINMUX(a, 8, 0x9c, 2, periph)
/* pa8_cclin2_in */
#define PA8_CCLIN2_IN    MCHP_PINMUX(a, 8, 0xa0, 9, periph)
/* pa8_cclin4_in */
#define PA8_CCLIN4_IN    MCHP_PINMUX(a, 8, 0xa8, 2, periph)
/* pa8_cclin5_in */
#define PA8_CCLIN5_IN    MCHP_PINMUX(a, 8, 0xac, 9, periph)
/* pa8_cclout0_out */
#define PA8_CCLOUT0_OUT  MCHP_PINMUX(a, 8, 0x254, 28, periph)
/* pa8_cclout1_out */
#define PA8_CCLOUT1_OUT  MCHP_PINMUX(a, 8, 0x250, 28, periph)
/* pa8_extint1_in */
#define PA8_EXTINT1_IN   MCHP_PINMUX(a, 8, 0x4, 2, periph)
/* pa8_extint2_in */
#define PA8_EXTINT2_IN   MCHP_PINMUX(a, 8, 0x8, 9, periph)
/* pa8_extint3_in */
#define PA8_EXTINT3_IN   MCHP_PINMUX(a, 8, 0xc, 14, periph)
/* pa8_nmi_in */
#define PA8_NMI_IN       MCHP_PINMUX(a, 8, 0x3c, 14, periph)
/* pa8_qcs_out */
#define PA8_QCS_OUT      MCHP_PINMUX(a, 8, 0x250, 24, periph)
/* pa8_qd0_in */
#define PA8_QD0_IN       MCHP_PINMUX(a, 8, 0x84, 14, periph)
/* pa8_qd0_out */
#define PA8_QD0_OUT      MCHP_PINMUX(a, 8, 0x250, 25, periph)
/* pa8_qd1_out */
#define PA8_QD1_OUT      MCHP_PINMUX(a, 8, 0x254, 25, periph)
/* pa8_qd2_in */
#define PA8_QD2_IN       MCHP_PINMUX(a, 8, 0x8c, 2, periph)
/* pa8_qd2_out */
#define PA8_QD2_OUT      MCHP_PINMUX(a, 8, 0x250, 27, periph)
/* pa8_qd3_in */
#define PA8_QD3_IN       MCHP_PINMUX(a, 8, 0x90, 9, periph)
/* pa8_qd3_out */
#define PA8_QD3_OUT      MCHP_PINMUX(a, 8, 0x250, 26, periph)
/* pa8_qsck_out */
#define PA8_QSCK_OUT     MCHP_PINMUX(a, 8, 0x250, 23, periph)
/* pa8_refo2_out */
#define PA8_REFO2_OUT    MCHP_PINMUX(a, 8, 0x250, 19, periph)
/* pa8_refo3_out */
#define PA8_REFO3_OUT    MCHP_PINMUX(a, 8, 0x254, 19, periph)
/* pa8_refo4_out */
#define PA8_REFO4_OUT    MCHP_PINMUX(a, 8, 0x258, 19, periph)
/* pa8_scom0p0_in */
#define PA8_SCOM0P0_IN   MCHP_PINMUX(a, 8, 0x40, 2, periph)
/* pa8_scom0p0_out */
#define PA8_SCOM0P0_OUT  MCHP_PINMUX(a, 8, 0x250, 1, periph)
/* pa8_scom0p1_in */
#define PA8_SCOM0P1_IN   MCHP_PINMUX(a, 8, 0x44, 9, periph)
/* pa8_scom0p1_out */
#define PA8_SCOM0P1_OUT  MCHP_PINMUX(a, 8, 0x254, 1, periph)
/* pa8_scom0p2_in */
#define PA8_SCOM0P2_IN   MCHP_PINMUX(a, 8, 0x48, 14, periph)
/* pa8_scom0p2_out */
#define PA8_SCOM0P2_OUT  MCHP_PINMUX(a, 8, 0x250, 3, periph)
/* pa8_scom0p3_out */
#define PA8_SCOM0P3_OUT  MCHP_PINMUX(a, 8, 0x250, 2, periph)
/* pa8_scom1p0_in */
#define PA8_SCOM1P0_IN   MCHP_PINMUX(a, 8, 0x50, 9, periph)
/* pa8_scom1p0_out */
#define PA8_SCOM1P0_OUT  MCHP_PINMUX(a, 8, 0x254, 5, periph)
/* pa8_scom1p1_in */
#define PA8_SCOM1P1_IN   MCHP_PINMUX(a, 8, 0x54, 14, periph)
/* pa8_scom1p1_out */
#define PA8_SCOM1P1_OUT  MCHP_PINMUX(a, 8, 0x250, 4, periph)
/* pa8_scom1p2_out */
#define PA8_SCOM1P2_OUT  MCHP_PINMUX(a, 8, 0x250, 6, periph)
/* pa8_scom1p3_in */
#define PA8_SCOM1P3_IN   MCHP_PINMUX(a, 8, 0x5c, 2, periph)
/* pa8_scom1p3_out */
#define PA8_SCOM1P3_OUT  MCHP_PINMUX(a, 8, 0x250, 5, periph)
/* pa8_tc0wo0g2_in */
#define PA8_TC0WO0G2_IN  MCHP_PINMUX(a, 8, 0xb4, 2, periph)
/* pa8_tc0wo0_out */
#define PA8_TC0WO0_OUT   MCHP_PINMUX(a, 8, 0x254, 18, periph)
/* pa8_tc0wo1g3_in */
#define PA8_TC0WO1G3_IN  MCHP_PINMUX(a, 8, 0xb8, 9, periph)
/* pa8_tc0wo1g4_in */
#define PA8_TC0WO1G4_IN  MCHP_PINMUX(a, 8, 0xbc, 14, periph)
/* pa8_tc0wo1_out */
#define PA8_TC0WO1_OUT   MCHP_PINMUX(a, 8, 0x250, 18, periph)
/* pa8_tc1wo0_out */
#define PA8_TC1WO0_OUT   MCHP_PINMUX(a, 8, 0x254, 20, periph)
/* pa8_tc1wo1g2_in */
#define PA8_TC1WO1G2_IN  MCHP_PINMUX(a, 8, 0xc4, 2, periph)
/* pa8_tc1wo1_out */
#define PA8_TC1WO1_OUT   MCHP_PINMUX(a, 8, 0x250, 20, periph)
/* pa8_tc2wo0g3_in */
#define PA8_TC2WO0G3_IN  MCHP_PINMUX(a, 8, 0xcc, 9, periph)
/* pa8_tc2wo0_out */
#define PA8_TC2WO0_OUT   MCHP_PINMUX(a, 8, 0x254, 21, periph)
/* pa8_tc2wo1g2_in */
#define PA8_TC2WO1G2_IN  MCHP_PINMUX(a, 8, 0xd0, 2, periph)
/* pa8_tc2wo1g4_in */
#define PA8_TC2WO1G4_IN  MCHP_PINMUX(a, 8, 0xd4, 14, periph)
/* pa8_tc2wo1_out */
#define PA8_TC2WO1_OUT   MCHP_PINMUX(a, 8, 0x250, 21, periph)
/* pa8_tc3wo0g3_in */
#define PA8_TC3WO0G3_IN  MCHP_PINMUX(a, 8, 0xdc, 9, periph)
/* pa8_tc3wo0_out */
#define PA8_TC3WO0_OUT   MCHP_PINMUX(a, 8, 0x254, 22, periph)
/* pa8_tc3wo1g2_in */
#define PA8_TC3WO1G2_IN  MCHP_PINMUX(a, 8, 0xe0, 2, periph)
/* pa8_tc3wo1g4_in */
#define PA8_TC3WO1G4_IN  MCHP_PINMUX(a, 8, 0xe4, 14, periph)
/* pa8_tc3wo1_out */
#define PA8_TC3WO1_OUT   MCHP_PINMUX(a, 8, 0x250, 22, periph)
/* pa8_tcc0wo0_out */
#define PA8_TCC0WO0_OUT  MCHP_PINMUX(a, 8, 0x254, 12, periph)
/* pa8_tcc0wo1_out */
#define PA8_TCC0WO1_OUT  MCHP_PINMUX(a, 8, 0x250, 11, periph)
/* pa8_tcc0wo2_out */
#define PA8_TCC0WO2_OUT  MCHP_PINMUX(a, 8, 0x254, 11, periph)
/* pa8_tcc0wo3_out */
#define PA8_TCC0WO3_OUT  MCHP_PINMUX(a, 8, 0x250, 13, periph)
/* pa8_tcc0wo4_out */
#define PA8_TCC0WO4_OUT  MCHP_PINMUX(a, 8, 0x254, 13, periph)
/* pa8_tcc0wo5_out */
#define PA8_TCC0WO5_OUT  MCHP_PINMUX(a, 8, 0x250, 12, periph)
/* pa8_tcc1wo0_out */
#define PA8_TCC1WO0_OUT  MCHP_PINMUX(a, 8, 0x254, 15, periph)
/* pa8_tcc1wo1_out */
#define PA8_TCC1WO1_OUT  MCHP_PINMUX(a, 8, 0x250, 14, periph)
/* pa8_tcc1wo2_out */
#define PA8_TCC1WO2_OUT  MCHP_PINMUX(a, 8, 0x254, 14, periph)
/* pa8_tcc1wo3_out */
#define PA8_TCC1WO3_OUT  MCHP_PINMUX(a, 8, 0x250, 16, periph)
/* pa8_tcc1wo4_out */
#define PA8_TCC1WO4_OUT  MCHP_PINMUX(a, 8, 0x254, 16, periph)
/* pa8_tcc1wo5_out */
#define PA8_TCC1WO5_OUT  MCHP_PINMUX(a, 8, 0x250, 15, periph)
/* pa8_tcc2wo0_out */
#define PA8_TCC2WO0_OUT  MCHP_PINMUX(a, 8, 0x254, 17, periph)
/* pa8_tcc2wo1_out */
#define PA8_TCC2WO1_OUT  MCHP_PINMUX(a, 8, 0x250, 17, periph)
/* pa9_cclin0_in */
#define PA9_CCLIN0_IN    MCHP_PINMUX(a, 9, 0x98, 15, periph)
/* pa9_cclin2_in */
#define PA9_CCLIN2_IN    MCHP_PINMUX(a, 9, 0xa0, 2, periph)
/* pa9_cclin3_in */
#define PA9_CCLIN3_IN    MCHP_PINMUX(a, 9, 0xa4, 15, periph)
/* pa9_cclin5_in */
#define PA9_CCLIN5_IN    MCHP_PINMUX(a, 9, 0xac, 2, periph)
/* pa9_cclout0_out */
#define PA9_CCLOUT0_OUT  MCHP_PINMUX(a, 9, 0x25c, 28, periph)
/* pa9_cclout1_out */
#define PA9_CCLOUT1_OUT  MCHP_PINMUX(a, 9, 0x264, 28, periph)
/* pa9_extint0_in */
#define PA9_EXTINT0_IN   MCHP_PINMUX(a, 9, 0x0, 15, periph)
/* pa9_extint2_in */
#define PA9_EXTINT2_IN   MCHP_PINMUX(a, 9, 0x8, 2, periph)
/* pa9_extint3_in */
#define PA9_EXTINT3_IN   MCHP_PINMUX(a, 9, 0xc, 9, periph)
/* pa9_nmi_in */
#define PA9_NMI_IN       MCHP_PINMUX(a, 9, 0x3c, 9, periph)
/* pa9_qcs_out */
#define PA9_QCS_OUT      MCHP_PINMUX(a, 9, 0x25c, 24, periph)
/* pa9_qd0_in */
#define PA9_QD0_IN       MCHP_PINMUX(a, 9, 0x84, 9, periph)
/* pa9_qd0_out */
#define PA9_QD0_OUT      MCHP_PINMUX(a, 9, 0x260, 26, periph)
/* pa9_qd1_in */
#define PA9_QD1_IN       MCHP_PINMUX(a, 9, 0x88, 15, periph)
/* pa9_qd1_out */
#define PA9_QD1_OUT      MCHP_PINMUX(a, 9, 0x25c, 27, periph)
/* pa9_qd2_out */
#define PA9_QD2_OUT      MCHP_PINMUX(a, 9, 0x25c, 26, periph)
/* pa9_qd3_in */
#define PA9_QD3_IN       MCHP_PINMUX(a, 9, 0x90, 2, periph)
/* pa9_qd3_out */
#define PA9_QD3_OUT      MCHP_PINMUX(a, 9, 0x25c, 25, periph)
/* pa9_qsck_in */
#define PA9_QSCK_IN      MCHP_PINMUX(a, 9, 0x80, 15, periph)
/* pa9_qsck_out */
#define PA9_QSCK_OUT     MCHP_PINMUX(a, 9, 0x25c, 23, periph)
/* pa9_refi_in */
#define PA9_REFI_IN      MCHP_PINMUX(a, 9, 0x94, 15, periph)
/* pa9_refo1_out */
#define PA9_REFO1_OUT    MCHP_PINMUX(a, 9, 0x25c, 19, periph)
/* pa9_refo3_out */
#define PA9_REFO3_OUT    MCHP_PINMUX(a, 9, 0x260, 19, periph)
/* pa9_refo4_out */
#define PA9_REFO4_OUT    MCHP_PINMUX(a, 9, 0x264, 19, periph)
/* pa9_scom0p0_out */
#define PA9_SCOM0P0_OUT  MCHP_PINMUX(a, 9, 0x260, 2, periph)
/* pa9_scom0p1_in */
#define PA9_SCOM0P1_IN   MCHP_PINMUX(a, 9, 0x44, 2, periph)
/* pa9_scom0p1_out */
#define PA9_SCOM0P1_OUT  MCHP_PINMUX(a, 9, 0x25c, 3, periph)
/* pa9_scom0p2_in */
#define PA9_SCOM0P2_IN   MCHP_PINMUX(a, 9, 0x48, 9, periph)
/* pa9_scom0p2_out */
#define PA9_SCOM0P2_OUT  MCHP_PINMUX(a, 9, 0x25c, 2, periph)
/* pa9_scom0p3_in */
#define PA9_SCOM0P3_IN   MCHP_PINMUX(a, 9, 0x4c, 15, periph)
/* pa9_scom0p3_out */
#define PA9_SCOM0P3_OUT  MCHP_PINMUX(a, 9, 0x25c, 1, periph)
/* pa9_scom1p0_in */
#define PA9_SCOM1P0_IN   MCHP_PINMUX(a, 9, 0x50, 2, periph)
/* pa9_scom1p0_out */
#define PA9_SCOM1P0_OUT  MCHP_PINMUX(a, 9, 0x25c, 4, periph)
/* pa9_scom1p1_in */
#define PA9_SCOM1P1_IN   MCHP_PINMUX(a, 9, 0x54, 9, periph)
/* pa9_scom1p1_out */
#define PA9_SCOM1P1_OUT  MCHP_PINMUX(a, 9, 0x25c, 6, periph)
/* pa9_scom1p2_in */
#define PA9_SCOM1P2_IN   MCHP_PINMUX(a, 9, 0x58, 15, periph)
/* pa9_scom1p2_out */
#define PA9_SCOM1P2_OUT  MCHP_PINMUX(a, 9, 0x25c, 5, periph)
/* pa9_scom1p3_out */
#define PA9_SCOM1P3_OUT  MCHP_PINMUX(a, 9, 0x260, 6, periph)
/* pa9_tc0wo0g1_in */
#define PA9_TC0WO0G1_IN  MCHP_PINMUX(a, 9, 0xb0, 15, periph)
/* pa9_tc0wo0_out */
#define PA9_TC0WO0_OUT   MCHP_PINMUX(a, 9, 0x260, 18, periph)
/* pa9_tc0wo1g3_in */
#define PA9_TC0WO1G3_IN  MCHP_PINMUX(a, 9, 0xb8, 2, periph)
/* pa9_tc0wo1g4_in */
#define PA9_TC0WO1G4_IN  MCHP_PINMUX(a, 9, 0xbc, 9, periph)
/* pa9_tc0wo1_out */
#define PA9_TC0WO1_OUT   MCHP_PINMUX(a, 9, 0x25c, 18, periph)
/* pa9_tc1wo0g1_in */
#define PA9_TC1WO0G1_IN  MCHP_PINMUX(a, 9, 0xc0, 15, periph)
/* pa9_tc1wo0_out */
#define PA9_TC1WO0_OUT   MCHP_PINMUX(a, 9, 0x25c, 20, periph)
/* pa9_tc1wo1_out */
#define PA9_TC1WO1_OUT   MCHP_PINMUX(a, 9, 0x264, 20, periph)
/* pa9_tc2wo0g1_in */
#define PA9_TC2WO0G1_IN  MCHP_PINMUX(a, 9, 0xc8, 15, periph)
/* pa9_tc2wo0g3_in */
#define PA9_TC2WO0G3_IN  MCHP_PINMUX(a, 9, 0xcc, 2, periph)
/* pa9_tc2wo0_out */
#define PA9_TC2WO0_OUT   MCHP_PINMUX(a, 9, 0x25c, 21, periph)
/* pa9_tc2wo1g4_in */
#define PA9_TC2WO1G4_IN  MCHP_PINMUX(a, 9, 0xd4, 9, periph)
/* pa9_tc2wo1_out */
#define PA9_TC2WO1_OUT   MCHP_PINMUX(a, 9, 0x264, 21, periph)
/* pa9_tc3wo0g1_in */
#define PA9_TC3WO0G1_IN  MCHP_PINMUX(a, 9, 0xd8, 15, periph)
/* pa9_tc3wo0g3_in */
#define PA9_TC3WO0G3_IN  MCHP_PINMUX(a, 9, 0xdc, 2, periph)
/* pa9_tc3wo0_out */
#define PA9_TC3WO0_OUT   MCHP_PINMUX(a, 9, 0x25c, 22, periph)
/* pa9_tc3wo1g4_in */
#define PA9_TC3WO1G4_IN  MCHP_PINMUX(a, 9, 0xe4, 9, periph)
/* pa9_tc3wo1_out */
#define PA9_TC3WO1_OUT   MCHP_PINMUX(a, 9, 0x264, 22, periph)
/* pa9_tcc0wo0_out */
#define PA9_TCC0WO0_OUT  MCHP_PINMUX(a, 9, 0x25c, 11, periph)
/* pa9_tcc0wo1_out */
#define PA9_TCC0WO1_OUT  MCHP_PINMUX(a, 9, 0x264, 12, periph)
/* pa9_tcc0wo2_out */
#define PA9_TCC0WO2_OUT  MCHP_PINMUX(a, 9, 0x25c, 13, periph)
/* pa9_tcc0wo3_out */
#define PA9_TCC0WO3_OUT  MCHP_PINMUX(a, 9, 0x264, 11, periph)
/* pa9_tcc0wo4_out */
#define PA9_TCC0WO4_OUT  MCHP_PINMUX(a, 9, 0x25c, 12, periph)
/* pa9_tcc0wo5_out */
#define PA9_TCC0WO5_OUT  MCHP_PINMUX(a, 9, 0x264, 13, periph)
/* pa9_tcc1wo0_out */
#define PA9_TCC1WO0_OUT  MCHP_PINMUX(a, 9, 0x25c, 14, periph)
/* pa9_tcc1wo1_out */
#define PA9_TCC1WO1_OUT  MCHP_PINMUX(a, 9, 0x264, 15, periph)
/* pa9_tcc1wo2_out */
#define PA9_TCC1WO2_OUT  MCHP_PINMUX(a, 9, 0x25c, 16, periph)
/* pa9_tcc1wo3_out */
#define PA9_TCC1WO3_OUT  MCHP_PINMUX(a, 9, 0x264, 14, periph)
/* pa9_tcc1wo4_out */
#define PA9_TCC1WO4_OUT  MCHP_PINMUX(a, 9, 0x25c, 15, periph)
/* pa9_tcc1wo5_out */
#define PA9_TCC1WO5_OUT  MCHP_PINMUX(a, 9, 0x264, 16, periph)
/* pa9_tcc2wo0_out */
#define PA9_TCC2WO0_OUT  MCHP_PINMUX(a, 9, 0x25c, 17, periph)
/* pa9_tcc2wo1_out */
#define PA9_TCC2WO1_OUT  MCHP_PINMUX(a, 9, 0x264, 17, periph)
/* pa10_cclin0_in */
#define PA10_CCLIN0_IN   MCHP_PINMUX(a, 10, 0x98, 10, periph)
/* pa10_cclin3_in */
#define PA10_CCLIN3_IN   MCHP_PINMUX(a, 10, 0xa4, 10, periph)
/* pa10_cclout0_out */
#define PA10_CCLOUT0_OUT MCHP_PINMUX(a, 10, 0x268, 28, periph)
/* pa10_cclout1_out */
#define PA10_CCLOUT1_OUT MCHP_PINMUX(a, 10, 0x26c, 28, periph)
/* pa10_extint0_in */
#define PA10_EXTINT0_IN  MCHP_PINMUX(a, 10, 0x0, 10, periph)
/* pa10_extint3_in */
#define PA10_EXTINT3_IN  MCHP_PINMUX(a, 10, 0xc, 2, periph)
/* pa10_nmi_in */
#define PA10_NMI_IN      MCHP_PINMUX(a, 10, 0x3c, 2, periph)
/* pa10_qcs_out */
#define PA10_QCS_OUT     MCHP_PINMUX(a, 10, 0x268, 24, periph)
/* pa10_qd0_in */
#define PA10_QD0_IN      MCHP_PINMUX(a, 10, 0x84, 2, periph)
/* pa10_qd0_out */
#define PA10_QD0_OUT     MCHP_PINMUX(a, 10, 0x26c, 27, periph)
/* pa10_qd1_in */
#define PA10_QD1_IN      MCHP_PINMUX(a, 10, 0x88, 10, periph)
/* pa10_qd1_out */
#define PA10_QD1_OUT     MCHP_PINMUX(a, 10, 0x268, 27, periph)
/* pa10_qd2_out */
#define PA10_QD2_OUT     MCHP_PINMUX(a, 10, 0x268, 26, periph)
/* pa10_qd3_out */
#define PA10_QD3_OUT     MCHP_PINMUX(a, 10, 0x268, 25, periph)
/* pa10_qsck_in */
#define PA10_QSCK_IN     MCHP_PINMUX(a, 10, 0x80, 10, periph)
/* pa10_qsck_out */
#define PA10_QSCK_OUT    MCHP_PINMUX(a, 10, 0x268, 23, periph)
/* pa10_refi_in */
#define PA10_REFI_IN     MCHP_PINMUX(a, 10, 0x94, 10, periph)
/* pa10_refo1_out */
#define PA10_REFO1_OUT   MCHP_PINMUX(a, 10, 0x268, 19, periph)
/* pa10_refo4_out */
#define PA10_REFO4_OUT   MCHP_PINMUX(a, 10, 0x26c, 19, periph)
/* pa10_scom0p0_out */
#define PA10_SCOM0P0_OUT MCHP_PINMUX(a, 10, 0x26c, 3, periph)
/* pa10_scom0p1_out */
#define PA10_SCOM0P1_OUT MCHP_PINMUX(a, 10, 0x268, 3, periph)
/* pa10_scom0p2_in */
#define PA10_SCOM0P2_IN  MCHP_PINMUX(a, 10, 0x48, 2, periph)
/* pa10_scom0p2_out */
#define PA10_SCOM0P2_OUT MCHP_PINMUX(a, 10, 0x268, 2, periph)
/* pa10_scom0p3_in */
#define PA10_SCOM0P3_IN  MCHP_PINMUX(a, 10, 0x4c, 10, periph)
/* pa10_scom0p3_out */
#define PA10_SCOM0P3_OUT MCHP_PINMUX(a, 10, 0x268, 1, periph)
/* pa10_scom1p0_out */
#define PA10_SCOM1P0_OUT MCHP_PINMUX(a, 10, 0x268, 4, periph)
/* pa10_scom1p1_in */
#define PA10_SCOM1P1_IN  MCHP_PINMUX(a, 10, 0x54, 2, periph)
/* pa10_scom1p1_out */
#define PA10_SCOM1P1_OUT MCHP_PINMUX(a, 10, 0x268, 6, periph)
/* pa10_scom1p2_in */
#define PA10_SCOM1P2_IN  MCHP_PINMUX(a, 10, 0x58, 10, periph)
/* pa10_scom1p2_out */
#define PA10_SCOM1P2_OUT MCHP_PINMUX(a, 10, 0x268, 5, periph)
/* pa10_scom1p3_out */
#define PA10_SCOM1P3_OUT MCHP_PINMUX(a, 10, 0x26c, 4, periph)
/* pa10_tc0wo0g1_in */
#define PA10_TC0WO0G1_IN MCHP_PINMUX(a, 10, 0xb0, 10, periph)
/* pa10_tc0wo0_out */
#define PA10_TC0WO0_OUT  MCHP_PINMUX(a, 10, 0x26c, 18, periph)
/* pa10_tc0wo1g4_in */
#define PA10_TC0WO1G4_IN MCHP_PINMUX(a, 10, 0xbc, 2, periph)
/* pa10_tc0wo1_out */
#define PA10_TC0WO1_OUT  MCHP_PINMUX(a, 10, 0x268, 18, periph)
/* pa10_tc1wo0g1_in */
#define PA10_TC1WO0G1_IN MCHP_PINMUX(a, 10, 0xc0, 10, periph)
/* pa10_tc1wo0_out */
#define PA10_TC1WO0_OUT  MCHP_PINMUX(a, 10, 0x268, 20, periph)
/* pa10_tc1wo1_out */
#define PA10_TC1WO1_OUT  MCHP_PINMUX(a, 10, 0x26c, 20, periph)
/* pa10_tc2wo0g1_in */
#define PA10_TC2WO0G1_IN MCHP_PINMUX(a, 10, 0xc8, 10, periph)
/* pa10_tc2wo0_out */
#define PA10_TC2WO0_OUT  MCHP_PINMUX(a, 10, 0x268, 21, periph)
/* pa10_tc2wo1g4_in */
#define PA10_TC2WO1G4_IN MCHP_PINMUX(a, 10, 0xd4, 2, periph)
/* pa10_tc2wo1_out */
#define PA10_TC2WO1_OUT  MCHP_PINMUX(a, 10, 0x26c, 21, periph)
/* pa10_tc3wo0g1_in */
#define PA10_TC3WO0G1_IN MCHP_PINMUX(a, 10, 0xd8, 10, periph)
/* pa10_tc3wo0_out */
#define PA10_TC3WO0_OUT  MCHP_PINMUX(a, 10, 0x268, 22, periph)
/* pa10_tc3wo1g4_in */
#define PA10_TC3WO1G4_IN MCHP_PINMUX(a, 10, 0xe4, 2, periph)
/* pa10_tc3wo1_out */
#define PA10_TC3WO1_OUT  MCHP_PINMUX(a, 10, 0x26c, 22, periph)
/* pa10_tcc0wo0_out */
#define PA10_TCC0WO0_OUT MCHP_PINMUX(a, 10, 0x268, 11, periph)
/* pa10_tcc0wo1_out */
#define PA10_TCC0WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 12, periph)
/* pa10_tcc0wo2_out */
#define PA10_TCC0WO2_OUT MCHP_PINMUX(a, 10, 0x268, 13, periph)
/* pa10_tcc0wo3_out */
#define PA10_TCC0WO3_OUT MCHP_PINMUX(a, 10, 0x26c, 11, periph)
/* pa10_tcc0wo4_out */
#define PA10_TCC0WO4_OUT MCHP_PINMUX(a, 10, 0x268, 12, periph)
/* pa10_tcc0wo5_out */
#define PA10_TCC0WO5_OUT MCHP_PINMUX(a, 10, 0x26c, 13, periph)
/* pa10_tcc1wo0_out */
#define PA10_TCC1WO0_OUT MCHP_PINMUX(a, 10, 0x268, 14, periph)
/* pa10_tcc1wo1_out */
#define PA10_TCC1WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 15, periph)
/* pa10_tcc1wo2_out */
#define PA10_TCC1WO2_OUT MCHP_PINMUX(a, 10, 0x268, 16, periph)
/* pa10_tcc1wo3_out */
#define PA10_TCC1WO3_OUT MCHP_PINMUX(a, 10, 0x26c, 14, periph)
/* pa10_tcc1wo4_out */
#define PA10_TCC1WO4_OUT MCHP_PINMUX(a, 10, 0x268, 15, periph)
/* pa10_tcc1wo5_out */
#define PA10_TCC1WO5_OUT MCHP_PINMUX(a, 10, 0x26c, 16, periph)
/* pa10_tcc2wo0_out */
#define PA10_TCC2WO0_OUT MCHP_PINMUX(a, 10, 0x268, 17, periph)
/* pa10_tcc2wo1_out */
#define PA10_TCC2WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 17, periph)
/* pb4_cclin0_in */
#define PB4_CCLIN0_IN    MCHP_PINMUX(b, 4, 0x98, 5, periph)
/* pb4_cclin1_in */
#define PB4_CCLIN1_IN    MCHP_PINMUX(b, 4, 0x9c, 12, periph)
/* pb4_cclin3_in */
#define PB4_CCLIN3_IN    MCHP_PINMUX(b, 4, 0xa4, 5, periph)
/* pb4_cclin4_in */
#define PB4_CCLIN4_IN    MCHP_PINMUX(b, 4, 0xa8, 12, periph)
/* pb4_cclout0_out */
#define PB4_CCLOUT0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 28, periph)
/* pb4_cclout1_out */
#define PB4_CCLOUT1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 28, periph)
/* pb4_extint0_in */
#define PB4_EXTINT0_IN   MCHP_PINMUX(b, 4, 0x0, 5, periph)
/* pb4_extint1_in */
#define PB4_EXTINT1_IN   MCHP_PINMUX(b, 4, 0x4, 12, periph)
/* pb4_qcs_out */
#define PB4_QCS_OUT      MCHP_PINMUX(b, 4, 0x2ac, 24, periph)
/* pb4_qd0_out */
#define PB4_QD0_OUT      MCHP_PINMUX(b, 4, 0x2b0, 25, periph)
/* pb4_qd1_in */
#define PB4_QD1_IN       MCHP_PINMUX(b, 4, 0x88, 5, periph)
/* pb4_qd1_out */
#define PB4_QD1_OUT      MCHP_PINMUX(b, 4, 0x2ac, 27, periph)
/* pb4_qd2_in */
#define PB4_QD2_IN       MCHP_PINMUX(b, 4, 0x8c, 12, periph)
/* pb4_qd2_out */
#define PB4_QD2_OUT      MCHP_PINMUX(b, 4, 0x2ac, 26, periph)
/* pb4_qd3_out */
#define PB4_QD3_OUT      MCHP_PINMUX(b, 4, 0x2ac, 25, periph)
/* pb4_qsck_in */
#define PB4_QSCK_IN      MCHP_PINMUX(b, 4, 0x80, 5, periph)
/* pb4_qsck_out */
#define PB4_QSCK_OUT     MCHP_PINMUX(b, 4, 0x2ac, 23, periph)
/* pb4_refi_in */
#define PB4_REFI_IN      MCHP_PINMUX(b, 4, 0x94, 5, periph)
/* pb4_refo1_out */
#define PB4_REFO1_OUT    MCHP_PINMUX(b, 4, 0x2ac, 19, periph)
/* pb4_refo2_out */
#define PB4_REFO2_OUT    MCHP_PINMUX(b, 4, 0x2b0, 19, periph)
/* pb4_scom0p0_in */
#define PB4_SCOM0P0_IN   MCHP_PINMUX(b, 4, 0x40, 12, periph)
/* pb4_scom0p0_out */
#define PB4_SCOM0P0_OUT  MCHP_PINMUX(b, 4, 0x2b0, 1, periph)
/* pb4_scom0p1_out */
#define PB4_SCOM0P1_OUT  MCHP_PINMUX(b, 4, 0x2ac, 3, periph)
/* pb4_scom0p2_out */
#define PB4_SCOM0P2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 2, periph)
/* pb4_scom0p3_in */
#define PB4_SCOM0P3_IN   MCHP_PINMUX(b, 4, 0x4c, 5, periph)
/* pb4_scom0p3_out */
#define PB4_SCOM0P3_OUT  MCHP_PINMUX(b, 4, 0x2ac, 1, periph)
/* pb4_scom1p0_out */
#define PB4_SCOM1P0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 4, periph)
/* pb4_scom1p1_out */
#define PB4_SCOM1P1_OUT  MCHP_PINMUX(b, 4, 0x2ac, 6, periph)
/* pb4_scom1p2_in */
#define PB4_SCOM1P2_IN   MCHP_PINMUX(b, 4, 0x58, 5, periph)
/* pb4_scom1p2_out */
#define PB4_SCOM1P2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 5, periph)
/* pb4_scom1p3_in */
#define PB4_SCOM1P3_IN   MCHP_PINMUX(b, 4, 0x5c, 12, periph)
/* pb4_scom1p3_out */
#define PB4_SCOM1P3_OUT  MCHP_PINMUX(b, 4, 0x2b0, 5, periph)
/* pb4_tc0wo0g1_in */
#define PB4_TC0WO0G1_IN  MCHP_PINMUX(b, 4, 0xb0, 5, periph)
/* pb4_tc0wo0g2_in */
#define PB4_TC0WO0G2_IN  MCHP_PINMUX(b, 4, 0xb4, 12, periph)
/* pb4_tc0wo1_out */
#define PB4_TC0WO1_OUT   MCHP_PINMUX(b, 4, 0x2ac, 18, periph)
/* pb4_tc1wo0g1_in */
#define PB4_TC1WO0G1_IN  MCHP_PINMUX(b, 4, 0xc0, 5, periph)
/* pb4_tc1wo0_out */
#define PB4_TC1WO0_OUT   MCHP_PINMUX(b, 4, 0x2ac, 20, periph)
/* pb4_tc1wo1g2_in */
#define PB4_TC1WO1G2_IN  MCHP_PINMUX(b, 4, 0xc4, 12, periph)
/* pb4_tc1wo1_out */
#define PB4_TC1WO1_OUT   MCHP_PINMUX(b, 4, 0x2b0, 20, periph)
/* pb4_tc2wo0g1_in */
#define PB4_TC2WO0G1_IN  MCHP_PINMUX(b, 4, 0xc8, 5, periph)
/* pb4_tc2wo0_out */
#define PB4_TC2WO0_OUT   MCHP_PINMUX(b, 4, 0x2ac, 21, periph)
/* pb4_tc2wo1g2_in */
#define PB4_TC2WO1G2_IN  MCHP_PINMUX(b, 4, 0xd0, 12, periph)
/* pb4_tc2wo1_out */
#define PB4_TC2WO1_OUT   MCHP_PINMUX(b, 4, 0x2b0, 21, periph)
/* pb4_tc3wo0g1_in */
#define PB4_TC3WO0G1_IN  MCHP_PINMUX(b, 4, 0xd8, 5, periph)
/* pb4_tc3wo0_out */
#define PB4_TC3WO0_OUT   MCHP_PINMUX(b, 4, 0x2ac, 22, periph)
/* pb4_tc3wo1g2_in */
#define PB4_TC3WO1G2_IN  MCHP_PINMUX(b, 4, 0xe0, 12, periph)
/* pb4_tc3wo1_out */
#define PB4_TC3WO1_OUT   MCHP_PINMUX(b, 4, 0x2b0, 22, periph)
/* pb4_tcc0wo0_out */
#define PB4_TCC0WO0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 11, periph)
/* pb4_tcc0wo1_out */
#define PB4_TCC0WO1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 11, periph)
/* pb4_tcc0wo2_out */
#define PB4_TCC0WO2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 13, periph)
/* pb4_tcc0wo3_out */
#define PB4_TCC0WO3_OUT  MCHP_PINMUX(b, 4, 0x2b0, 13, periph)
/* pb4_tcc0wo4_out */
#define PB4_TCC0WO4_OUT  MCHP_PINMUX(b, 4, 0x2ac, 12, periph)
/* pb4_tcc0wo5_out */
#define PB4_TCC0WO5_OUT  MCHP_PINMUX(b, 4, 0x2b0, 12, periph)
/* pb4_tcc1wo0_out */
#define PB4_TCC1WO0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 14, periph)
/* pb4_tcc1wo1_out */
#define PB4_TCC1WO1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 14, periph)
/* pb4_tcc1wo2_out */
#define PB4_TCC1WO2_OUT  MCHP_PINMUX(b, 4, 0x2ac, 16, periph)
/* pb4_tcc1wo3_out */
#define PB4_TCC1WO3_OUT  MCHP_PINMUX(b, 4, 0x2b0, 16, periph)
/* pb4_tcc1wo4_out */
#define PB4_TCC1WO4_OUT  MCHP_PINMUX(b, 4, 0x2ac, 15, periph)
/* pb4_tcc1wo5_out */
#define PB4_TCC1WO5_OUT  MCHP_PINMUX(b, 4, 0x2b0, 15, periph)
/* pb4_tcc2wo0_out */
#define PB4_TCC2WO0_OUT  MCHP_PINMUX(b, 4, 0x2ac, 17, periph)
/* pb4_tcc2wo1_out */
#define PB4_TCC2WO1_OUT  MCHP_PINMUX(b, 4, 0x2b0, 17, periph)
/* pb5_cclin1_in */
#define PB5_CCLIN1_IN    MCHP_PINMUX(b, 5, 0x9c, 5, periph)
/* pb5_cclin2_in */
#define PB5_CCLIN2_IN    MCHP_PINMUX(b, 5, 0xa0, 12, periph)
/* pb5_cclin4_in */
#define PB5_CCLIN4_IN    MCHP_PINMUX(b, 5, 0xa8, 5, periph)
/* pb5_cclin5_in */
#define PB5_CCLIN5_IN    MCHP_PINMUX(b, 5, 0xac, 12, periph)
/* pb5_cclout0_out */
#define PB5_CCLOUT0_OUT  MCHP_PINMUX(b, 5, 0x2b8, 28, periph)
/* pb5_cclout1_out */
#define PB5_CCLOUT1_OUT  MCHP_PINMUX(b, 5, 0x2b4, 28, periph)
/* pb5_extint1_in */
#define PB5_EXTINT1_IN   MCHP_PINMUX(b, 5, 0x4, 5, periph)
/* pb5_extint2_in */
#define PB5_EXTINT2_IN   MCHP_PINMUX(b, 5, 0x8, 12, periph)
/* pb5_qcs_out */
#define PB5_QCS_OUT      MCHP_PINMUX(b, 5, 0x2b4, 24, periph)
/* pb5_qd0_out */
#define PB5_QD0_OUT      MCHP_PINMUX(b, 5, 0x2b4, 25, periph)
/* pb5_qd1_out */
#define PB5_QD1_OUT      MCHP_PINMUX(b, 5, 0x2b8, 25, periph)
/* pb5_qd2_in */
#define PB5_QD2_IN       MCHP_PINMUX(b, 5, 0x8c, 5, periph)
/* pb5_qd2_out */
#define PB5_QD2_OUT      MCHP_PINMUX(b, 5, 0x2b4, 27, periph)
/* pb5_qd3_in */
#define PB5_QD3_IN       MCHP_PINMUX(b, 5, 0x90, 12, periph)
/* pb5_qd3_out */
#define PB5_QD3_OUT      MCHP_PINMUX(b, 5, 0x2b4, 26, periph)
/* pb5_qsck_out */
